package Test;

public class NameMatch {
	public static void main (String[] args) {
		
		//Даны имена 2х человек (тип String). Если имена равны, то вывести сообщение о том, что люди являются тезками.
		String name1="абракадабра";
		String name2="абракадабра ";
		
		if (name1.equals(name2) ) {System.out.println("Names are equal");}
		else System.out.println("Names are different");
			
		
		
	}

}
